-- --------------------------------------------------------
-- 호스트:                          127.0.0.1
-- 서버 버전:                        PostgreSQL 15.1, compiled by Visual C++ build 1914, 64-bit
-- 서버 OS:                        
-- HeidiSQL 버전:                  12.3.0.6589
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES  */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

-- 테이블 public.date_data 구조 내보내기
DROP TABLE IF EXISTS "date_data";
CREATE TABLE IF NOT EXISTS "date_data" (
	"date" VARCHAR NOT NULL,
	"store" VARCHAR(100) NOT NULL,
	"point_x" VARCHAR NULL DEFAULT NULL,
	"point_y" VARCHAR NULL DEFAULT NULL,
	"title" VARCHAR NULL DEFAULT NULL,
	"main_img" VARCHAR NOT NULL DEFAULT 'false'
);

-- 테이블 데이터 public.date_data:24 rows 내보내기
DELETE FROM "date_data";
/*!40000 ALTER TABLE "date_data" DISABLE KEYS */;
INSERT INTO "date_data" ("date", "store", "point_x", "point_y", "title", "main_img") VALUES
	('2023.09.23', '바르바커피', '126.5692803', '37.2799173', '우리가 사랑을 약속한 곳', 'false'),
	('2024.01.01', '모힝', '126.9535336', '37.4790790', '새해에도 또 그 후에도 항상 너의 곁에 있을게', 'false'),
	('2023.09.23', '청춘조개', '126.6871246', '37.3430517', '우리가 사랑을 약속한 곳', 'false'),
	('2024.03.01', '야키토리 묵', '126.9245686', '37.5646628', '라니와 찐코의 두근두근 마음 여행', 'false'),
	('2024.03.05', '팔각도 설입점', '126.9537862', '37.4800993', '맛있는 닭갈비 냠냠', 'false'),
	('2023.09.23', '고백한 곳', '126.579825', '37.2901', '우리가 사랑을 약속한 곳', 'true'),
	('2024.01.01', '황홀경', '126.9546167', '37.4789569', '새해에도 또 그 후에도 항상 너의 곁에 있을게', 'true'),
	('2024.03.01', '홍턴살롱', '126.9218773', '37.5580401', '라니와 찐코의 두근두근 마음 여행', 'false'),
	('2024.03.05', '카페프레임', '126.9576001', '37.4779057', '귀여운 카페 발견!', 'true'),
	('2024.03.16', '롯데월드', '127.0981638', '37.5110794', '햄찌와 망고미의 롯데월드 대탐험', 'true'),
	('2024.03.01', '4233마음센터', '126.9215388', '37.5582149', '라니와 찐코의 두근 두근 마음 여행', 'false'),
	('2024.02.17', '포레스트청담', '127.0389977', '37.5239312', '햄찌한테 망고미 사랑표식 넘겨준날', 'true'),
	('2024.03.01', '타인. 나 자신', '126.9140222', '37.5458445', '라니와 찐코의 두근두근 마음 여행', 'true'),
	('2024.05.15', '동대문디자인플라자', '127.0099323', '37.5675466', '햄찌와 나몬이', 'true'),
	('2024.05.15', '동대문디자인플라자', '127.0099323', '37.5675466', '햄찌와 나몬이', 'false'),
	('2024.05.15', '동대문디자인플라자', '127.0099323', '37.5675466', '햄찌와 나몬이', 'false'),
	('2024.05.25', '테이블에이', '126.9294989', '37.5540547', '햄찌 ♥ 망레디독', 'false'),
	('2024.05.25', '테이블에이', '126.9294989', '37.5540547', '햄찌 ♥ 망레디독', 'false'),
	('2024.05.04', '햄찌랑 차안에서 한컷', '126.9282001', '37.7739194', '햄찌와 파주 힐링 여행', 'false'),
	('2024.05.04', '파주 마장호수 흔들다리', '126.9277758', '37.7730653', '햄찌와 파주 힐링 여행', 'false'),
	('2024.05.04', '레드브릿지', '126.9282001', '37.7739194', '햄찌와 파주 힐링 여행', 'true'),
	('2024.04.12', '무드서울', '126.9959810', '37.5124526', '라니 생일 ♥', 'true'),
	('2024.04.12', '한강 크루즈', '126.9390044', '37.5249919', '라니 생일 ♥', 'false'),
	('2024.04.12', '비스타 워커힐', '127.1107738', '37.5551690', '라니 생일 ♥', 'false');
/*!40000 ALTER TABLE "date_data" ENABLE KEYS */;

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
